In [5]:
# !pip install numpy

In [1]:
import pandas as pd
import numpy as np

In [2]:
pd.__version__

'2.2.1'

In [14]:
titanic_df = pd.read_csv('Titanic_data.csv', nrows=50)

## DataFrame Exploration

In [15]:
titanic_df.shape

(50, 12)

In [16]:
titanic_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [17]:
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [18]:
titanic_df.tail(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
48,49,0,3,"Samaan, Mr. Youssef",male,NaN,2,0,2662,21.6792,NaN,C
49,50,0,3,"Arnold-Franchi, Mrs. Josef (Josefine Franchi)",female,18.0,1,0,349237,17.8000,NaN,S

In [19]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 50 entries, 0 to 49
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  50 non-null     int64
 1   Survived     50 non-null     int64
 2   Pclass       50 non-null     int64
 3   Name         50 non-null     object
 4   Sex          50 non-null     object
 5   Age          36 non-null     float64
 6   SibSp        50 non-null     int64
 7   Parch        50 non-null     int64
 8   Ticket       50 non-null     object
 9   Fare         50 non-null     float64
 10  Cabin        9 non-null      object
 11  Embarked     50 non-null     object
dtypes: float64(2), int64(5), object(5)
memory usage: 4.8+ KB

In [22]:
titanic_df[['Age']].describe()

             Age        Fare
count  36.000000   50.000000
mean   27.472222   27.895416
std    16.002654   41.907601
min     2.000000    7.225000
25%    17.250000    8.034400
50%    27.000000   15.750000
75%    38.000000   28.773950
max    66.000000  263.000000

- Average age is 27 which suggest most of the passenger are young people.
- Mean nearly equal to Median , suggesting a symmetrical distribution.

In [23]:
titanic_df[['Age','Fare']].describe()

             Age        Fare
count  36.000000   50.000000
mean   27.472222   27.895416
std    16.002654   41.907601
min     2.000000    7.225000
25%    17.250000    8.034400
50%    27.000000   15.750000
75%    38.000000   28.773950
max    66.000000  263.000000

In [26]:
# df.value_counts()
titanic_df.value_counts("Sex", normalize=True)

Sex
female    0.5
male      0.5
Name: proportion, dtype: float64

In [34]:
titanic_df[titanic_df["Sex"] == "male"].value_counts("Survived", ascending=False)

Survived
0    21
1     4
Name: count, dtype: int64

In [35]:
titanic_df[titanic_df["Sex"] == "female"].value_counts("Survived", ascending=False)

Survived
1    18
0     7
Name: count, dtype: int64

In [37]:
titanic_df.value_counts(["Sex", "Survived"])

Sex     Survived
male    0           21
female  1           18
        0            7
male    1            4
Name: count, dtype: int64

In [40]:
# unique()
# nunique()

titanic_df['Embarked'].unique()

array(['S', 'C', 'Q'], dtype=object)

In [41]:
titanic_df['Embarked'].nunique()

3

In [45]:
# isna() or isnull()
titanic_df.isna().sum()

PassengerId     0
Survived        0
Pclass          0
Name            0
Sex             0
Age            14
SibSp           0
Parch           0
Ticket          0
Fare            0
Cabin          41
Embarked        0
dtype: int64

In [50]:
titanic_df [titanic_df['Cabin'].notna()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
21,22,1,2,"Beesley, Mr. Lawrence",male,34.0,0,0,248698,13.0000,D56,S
23,24,1,1,"Sloper, Mr. William Thompson",male,28.0,0,0,113788,35.5000,A6,S
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,PC 17569,146.5208,B78,C